{
  "about": "About me",
  "experience": "Experience",
  "projects": "Projects",
  "homeAbout": "Developer passionated about the idea of creating useful applications for the persons.",
  "contact": "Contact",
  "cv": "Downlaod CV",
  "aboutParagraphs": [
    "I'm a Software Developer passionate about the idea of ​​being able to convert ideas into technological solutions that positively impact the lives of others. By constantly learning and searching for new challenges that allow me to continue growing as a professional.",
    "I have a great notion of responsibility and teamwork, always focused on meeting the objectives I set for myself, where I make use of my ability to analyze and solve problems, which allows me to approach projects with a comprehensive and efficient vision."
  ],
  "skills": "Skills",
  "certifications": "Certifications",
  "experienceSkills": "My Experience & Skills",
  "projectsP": "Check out the projects I have done and with which technologies they were created.",
  "techStack": "Tech Stack",
  "projectsList": [
    {
      "name": "BeSporty",
      "type": "Fullstack Web App",
      "description": "Web application for a sports equipment e-commerce."
    },
    {
      "name": "Kemish Music",
      "type": "C# .NET Deskptop App",
      "description": "Desktop application for music playback."
    }
  ],
  "repository": "View repository",
  "viewProject": "View project",
  "experienceList": [
    {
      "roles": [
        {
          "role": "Software Developer",
          "date": "April 2025 - Present",
          "descriptions": [
            "Led the development and integration of Android modules (Java) for the registration and retrieval of administrative data, connected to web services, improving field staff efficiency.",
            "Improved performance, security, and scalability of ASP.NET web applications, ensuring high availability and an optimized user experience.",
            "Automated key administrative processes through digital solutions tailored to internal needs, reducing operation times and manual errors"
          ]
        },
        {
          "role": "Software Development Intern",
          "date": "July 2024 - April 2025",
          "descriptions": [
            "Provided preventive technical support and resolved issues through a ticketing system, while also designing and developing new modules and features for the company’s applications."
          ]
        }
      ],
      "company": "RSI México",
      "technologies": ["Android", ".NET", "Problem Solving"],
      "companyLogo": "rsi_mexico_logo.webp"
    },
    {
      "roles": [
        {
          "role": "Full-Stack Developer in Hackathon",
          "date": "November 2022",
          "descriptions": [
            "Played a key role in developing a web application project that achieved third place in a Hackathon, that was organized by SuperTeamMexico and CryptoMexico, where blockchain was the main theme. implemented the use of APIs and ensured smooth operation of the application components built with React in Next JS."
          ]
        }
      ],
      "company": "SuperTeam Mexico",
      "technologies": ["Next JS", "Crypto"],
      "companyLogo": "superteam_logo.webp"
    }
  ],
  "certificationsList":  [
    {
      "date": "December 2022",
      "title": "Full-Stack Developer",
      "institution": "San Diego Global Knowledge University",
      "description": "Sed ut justo lectus. Aliquam condimentum risus nisl. Suspendisse potenti. Fusce quis suscipit erat, quis sodales eros. Vestibulum ac mi sem.",
      "technologies": ["Frontend", "Backend", "Software Engineering"],
      "link": "https://drive.google.com/file/d/1IrLzIND5Wz_TCVI6ZOCAV6ZFNMcTwlju/view?usp=sharing"
    }
  ]
}