{
  "about": "Sobre mí",
  "experience": "Experiencia",
  "projects": "Proyectos",
  "homeAbout": "Desarrollador apasionado por la idea de crear aplicaciones útiles para las personas.",
  "contact": "Contáctame",
  "cv": "Descargar CV",
  "aboutParagraphs": [
    "Soy un desarrollador de software apasionado por la idea de crear aplicaciones que puedan llegar a ayudar a las personas. Me motiva el poder convertir las ideas en soluciones tecnológicas que impacten positivamente en la vida de los demás.",
    "Cuento con una gran noción de la responsabilidad y el trabajo en equipo, siempre enfocado en cumplir los objetivos que me planteo, donde hago uso de mi capacidad de análisis y resolución de problemas, lo que me permite abordar los proyectos con una visión integral y eficiente."
  ],
  "skills": "Habilidades",
  "certifications": "Certificaciones",
  "experienceSkills": "Mi Experiencia y Habilidades",
  "projectsP": "Revisa los proyectos que he realizado y con qué tecnologías fueron creados.",
  "techStack": "Tecnologías",
  "projectsList": [
    {
      "name": "ParkMe",
      "type": "Solución IoT",
      "description": "ParkMe es un sistema automatizado de gestión de estacionamientos que utiliza una combinación de sensores, RFID y un microcontrolador para monitorear y controlar el acceso de vehículos a una zona de aparcamiento.",
      "descriptions": [
        "ParkMe es un sistema automatizado de gestión de estacionamientos que utiliza una combinación de sensores, RFID y un microcontrolador para monitorear y controlar el acceso de vehículos a una zona de aparcamiento."
      ]
    },
    {
      "name": "Sign Language to Text",
      "type": "Computer Vision / Machine Learning",
      "description": "Sistema de reconocimiento de lenguaje de señas que traduce gestos manuales a texto en tiempo real utilizando visión por computadora y modelos de aprendizaje automático.",
      "descriptions": [
        "El proyecto captura gestos de lenguaje de señas mediante una cámara y utiliza técnicas de Computer Vision para extraer puntos clave de la mano.",
        "Los datos obtenidos son procesados con modelos de Machine Learning entrenados para reconocer secuencias de movimientos y convertirlas en texto legible.",
        "El prototipo se planteó como una solución a la dificultad de comunicación para personas que se comunican mediante lenguaje de señas."
      ]
    },
    {
      "name": "BeSporty",
      "type": "Aplicación web Fullstack",
      "description": "Aplicación web para una tienda de artículos deportivos.",
      "descriptions": [
        "Plataforma web fullstack orientada al comercio electrónico de artículos deportivos, diseñada para la gestión de productos, navegación de catálogo y experiencia de compra del usuario."
      ]
    },
    {
      "name": "Kemish Music",
      "type": "Aplicación de escritorio C# .NET",
      "description": "Aplicación de escritorio para reproducción de música.",
      "descriptions": [
        "Aplicación de escritorio desarrollada en C# .NET para la reproducción y gestión de música, permitiendo organizar bibliotecas musicales y controlar la reproducción de manera intuitiva desde una interfaz amigable."
      ]
    },
    {
      "name": "Chilango",
      "type": "Aplicación de escritorio C# .NET WPF",
      "description": "Aplicación de escritorio para gestionar órdenes e inventario en un restaurante.",
      "descriptions": [
        "Sistema de escritorio desarrollado en C# .NET WPF para la administración de órdenes e inventario en restaurantes."
      ]
    }
  ],
  "repository": "Ver repositorio",
  "viewProject": "Ver proyecto",
  "experienceList": [
    {
      "roles": [
        {
          "role": "Desarrollador de Software",
          "date": "Abril 2025 - Presente",
          "descriptions": [
            "Lideré el desarrollo e integración de módulos Android (Java) para el registro y recuperación de datos administrativos, conectados a servicios web, mejorando la eficiencia del personal de campo.",
            "Mejoré el rendimiento, la seguridad y la escalabilidad de aplicaciones web ASP.NET, asegurando alta disponibilidad y una experiencia de usuario optimizada.",
            "Automatizé procesos administrativos clave mediante soluciones digitales adaptadas a necesidades internas, reduciendo tiempos de operación y errores manuales."
          ],
          "technologies": ["ASP.NET Core", "Docker", "Linux", "n8n"]
        },
        {
          "role": "Practicante de Desarrollo de Software",
          "date": "Julio 2024 - Abril 2025",
          "descriptions": [
            "Brindé soporte técnico preventivo y resolví incidencias a través de un sistema de tickets, además de diseñar y desarrollar nuevos módulos y funcionalidades para las aplicaciones de la empresa."
          ],
          "technologies": ["Android", ".NET", "Problem Solving"]
        }
      ],
      "company": "RSI México",
      "companyLogo": "rsi_mexico_logo.webp"
    },
    {
      "roles": [
        {
          "role": "Desarrollador Full-Stack en Hackaton",
          "date": "Noviembre 2022",
          "descriptions": [
            "Desempeñé un papel clave en el desarrollo de un proyecto de aplicación web que obtuvo el tercer lugar en un Hackathon organizado por SuperTeamMexico y CryptoMexico, donde la temática principal fue blockchain. Implementé el uso de APIs y aseguré el correcto funcionamiento de los componentes de la aplicación construidos con React en Next JS."
          ],
          "technologies": ["Next JS", "Crypto"]
        }
      ],
      "company": "SuperTeam México",
      "companyLogo": "superteam_logo.webp"
    }
  ],
  "certificationsList": [
    {
      "date": "Diciembre 2022",
      "title": "Desarrollador Full-Stack",
      "institution": "San Diego Global Knowledge University",
      "description": [
        "As part of my training in the FSDI program, I acquired strong skills in software and web application development.",
        "I specialized as a full-stack web developer, covering all levels of development: from the user interface (UI) and front-end, to business logic in the middle layer and back-end.",
        "During the program, I worked with key technologies such as HTML, CSS, JavaScript, Node.js, React, ASP.NET, and Python, as well as essential tools like GitHub and agile methodologies such as Scrum and Agile."
      ],
      "technologies": ["Frontend", "Backend", "Ingeniería de Software"],
      "link": "https://drive.google.com/file/d/1IrLzIND5Wz_TCVI6ZOCAV6ZFNMcTwlju/view?usp=sharing"
    },
    {
      "date": "Marzo 2024",
      "title": "Aprende Programación Backend en C# .NET",
      "institution": "Udemy",
      "description": [
        "Durante el curso 'Aprende Programación Backend en C# .NET', adquirí habilidades sólidas en el desarrollo de aplicaciones backend utilizando el ecosistema de .NET.",
        "Me enfoqué en la construcción de APIs, manejo de bases de datos, control de dependencias y arquitectura de software, aplicando principios de programación orientada a objetos en C#.",
        "A lo largo del curso, trabajé con tecnologías clave como C#, .NET, Entity Framework, LINQ y SQL Server, además del uso de herramientas como Visual Studio y Git para el control de versiones."
      ],
      "technologies": ["Backend", ".NET", "Arquitectura de Software"],
      "link": "https://drive.google.com/file/d/13CG-uaEVBxWcGZdqhML299V9JuZ_hddf/view?usp=sharing"
    }
  ],
  "besporty": "Aplicación web para un e-commerce de artículos deportivos.",
  "kemishmusic": "Aplicación de escritorio para reproducción de música.",
  "chilango": "Aplicación de escritorio para gestionar órdenes e inventario en un restaurante.",
  "parkme": "Sistema automatizado de gestión de estacionamientos usando Arduino y Raspberry Pi.",
  "signlanguage": "Sistema de reconocimiento de lenguaje de señas a texto."
}